sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/**
  ******************************************************************************
  * @file    mjenc_q_sram_reg.h
  * @version V1.2
  * @date    2020-07-31
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __MJENC_Q_SRAM_REG_H__
#define  __MJENC_Q_SRAM_REG_H__

#include "bl808.h"

/* 0x400 : mjpeg_q_param_00 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_00_OFFSET                    (0x400)
#define MJENC_Q_SRAM_REG_Q_0_00                                 MJENC_Q_SRAM_REG_Q_0_00
#define MJENC_Q_SRAM_REG_Q_0_00_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_00_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_00_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_00_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_00_POS)
#define MJENC_Q_SRAM_REG_Q_0_00_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_00_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_00_POS))
#define MJENC_Q_SRAM_REG_Q_0_01                                 MJENC_Q_SRAM_REG_Q_0_01
#define MJENC_Q_SRAM_REG_Q_0_01_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_01_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_01_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_01_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_01_POS)
#define MJENC_Q_SRAM_REG_Q_0_01_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_01_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_01_POS))

/* 0x404 : mjpeg_q_param_02 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_02_OFFSET                    (0x404)
#define MJENC_Q_SRAM_REG_Q_0_02                                 MJENC_Q_SRAM_REG_Q_0_02
#define MJENC_Q_SRAM_REG_Q_0_02_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_02_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_02_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_02_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_02_POS)
#define MJENC_Q_SRAM_REG_Q_0_02_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_02_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_02_POS))
#define MJENC_Q_SRAM_REG_Q_0_03                                 MJENC_Q_SRAM_REG_Q_0_03
#define MJENC_Q_SRAM_REG_Q_0_03_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_03_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_03_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_03_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_03_POS)
#define MJENC_Q_SRAM_REG_Q_0_03_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_03_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_03_POS))

/* 0x408 : mjpeg_q_param_04 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_04_OFFSET                    (0x408)
#define MJENC_Q_SRAM_REG_Q_0_04                                 MJENC_Q_SRAM_REG_Q_0_04
#define MJENC_Q_SRAM_REG_Q_0_04_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_04_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_04_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_04_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_04_POS)
#define MJENC_Q_SRAM_REG_Q_0_04_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_04_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_04_POS))
#define MJENC_Q_SRAM_REG_Q_0_05                                 MJENC_Q_SRAM_REG_Q_0_05
#define MJENC_Q_SRAM_REG_Q_0_05_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_05_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_05_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_05_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_05_POS)
#define MJENC_Q_SRAM_REG_Q_0_05_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_05_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_05_POS))

/* 0x40C : mjpeg_q_param_06 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_06_OFFSET                    (0x40C)
#define MJENC_Q_SRAM_REG_Q_0_06                                 MJENC_Q_SRAM_REG_Q_0_06
#define MJENC_Q_SRAM_REG_Q_0_06_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_06_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_06_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_06_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_06_POS)
#define MJENC_Q_SRAM_REG_Q_0_06_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_06_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_06_POS))
#define MJENC_Q_SRAM_REG_Q_0_07                                 MJENC_Q_SRAM_REG_Q_0_07
#define MJENC_Q_SRAM_REG_Q_0_07_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_07_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_07_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_07_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_07_POS)
#define MJENC_Q_SRAM_REG_Q_0_07_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_07_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_07_POS))

/* 0x410 : mjpeg_q_param_08 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_08_OFFSET                    (0x410)
#define MJENC_Q_SRAM_REG_Q_0_08                                 MJENC_Q_SRAM_REG_Q_0_08
#define MJENC_Q_SRAM_REG_Q_0_08_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_08_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_08_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_08_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_08_POS)
#define MJENC_Q_SRAM_REG_Q_0_08_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_08_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_08_POS))
#define MJENC_Q_SRAM_REG_Q_0_09                                 MJENC_Q_SRAM_REG_Q_0_09
#define MJENC_Q_SRAM_REG_Q_0_09_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_09_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_09_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_09_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_09_POS)
#define MJENC_Q_SRAM_REG_Q_0_09_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_09_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_09_POS))

