sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x414 : mjpeg_q_param_0a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_0A_OFFSET                    (0x414)
#define MJENC_Q_SRAM_REG_Q_0_0A                                 MJENC_Q_SRAM_REG_Q_0_0A
#define MJENC_Q_SRAM_REG_Q_0_0A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_0A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0A_POS)
#define MJENC_Q_SRAM_REG_Q_0_0A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0A_POS))
#define MJENC_Q_SRAM_REG_Q_0_0B                                 MJENC_Q_SRAM_REG_Q_0_0B
#define MJENC_Q_SRAM_REG_Q_0_0B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_0B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0B_POS)
#define MJENC_Q_SRAM_REG_Q_0_0B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0B_POS))

/* 0x418 : mjpeg_q_param_0c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_0C_OFFSET                    (0x418)
#define MJENC_Q_SRAM_REG_Q_0_0C                                 MJENC_Q_SRAM_REG_Q_0_0C
#define MJENC_Q_SRAM_REG_Q_0_0C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_0C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0C_POS)
#define MJENC_Q_SRAM_REG_Q_0_0C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0C_POS))
#define MJENC_Q_SRAM_REG_Q_0_0D                                 MJENC_Q_SRAM_REG_Q_0_0D
#define MJENC_Q_SRAM_REG_Q_0_0D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_0D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0D_POS)
#define MJENC_Q_SRAM_REG_Q_0_0D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0D_POS))

/* 0x41C : mjpeg_q_param_0e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_0E_OFFSET                    (0x41C)
#define MJENC_Q_SRAM_REG_Q_0_0E                                 MJENC_Q_SRAM_REG_Q_0_0E
#define MJENC_Q_SRAM_REG_Q_0_0E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_0E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0E_POS)
#define MJENC_Q_SRAM_REG_Q_0_0E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0E_POS))
#define MJENC_Q_SRAM_REG_Q_0_0F                                 MJENC_Q_SRAM_REG_Q_0_0F
#define MJENC_Q_SRAM_REG_Q_0_0F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_0F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_0F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_0F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0F_POS)
#define MJENC_Q_SRAM_REG_Q_0_0F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_0F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_0F_POS))

/* 0x420 : mjpeg_q_param_10 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_10_OFFSET                    (0x420)
#define MJENC_Q_SRAM_REG_Q_0_10                                 MJENC_Q_SRAM_REG_Q_0_10
#define MJENC_Q_SRAM_REG_Q_0_10_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_10_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_10_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_10_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_10_POS)
#define MJENC_Q_SRAM_REG_Q_0_10_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_10_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_10_POS))
#define MJENC_Q_SRAM_REG_Q_0_11                                 MJENC_Q_SRAM_REG_Q_0_11
#define MJENC_Q_SRAM_REG_Q_0_11_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_11_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_11_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_11_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_11_POS)
#define MJENC_Q_SRAM_REG_Q_0_11_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_11_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_11_POS))

/* 0x424 : mjpeg_q_param_12 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_12_OFFSET                    (0x424)
#define MJENC_Q_SRAM_REG_Q_0_12                                 MJENC_Q_SRAM_REG_Q_0_12
#define MJENC_Q_SRAM_REG_Q_0_12_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_12_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_12_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_12_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_12_POS)
#define MJENC_Q_SRAM_REG_Q_0_12_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_12_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_12_POS))
#define MJENC_Q_SRAM_REG_Q_0_13                                 MJENC_Q_SRAM_REG_Q_0_13
#define MJENC_Q_SRAM_REG_Q_0_13_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_13_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_13_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_13_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_13_POS)
#define MJENC_Q_SRAM_REG_Q_0_13_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_13_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_13_POS))

/* 0x428 : mjpeg_q_param_14 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_14_OFFSET                    (0x428)
#define MJENC_Q_SRAM_REG_Q_0_14                                 MJENC_Q_SRAM_REG_Q_0_14
#define MJENC_Q_SRAM_REG_Q_0_14_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_14_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_14_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_14_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_14_POS)
#define MJENC_Q_SRAM_REG_Q_0_14_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_14_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_14_POS))
#define MJENC_Q_SRAM_REG_Q_0_15                                 MJENC_Q_SRAM_REG_Q_0_15
#define MJENC_Q_SRAM_REG_Q_0_15_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_15_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_15_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_15_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_15_POS)
#define MJENC_Q_SRAM_REG_Q_0_15_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_15_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_15_POS))

/* 0x42C : mjpeg_q_param_16 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_16_OFFSET                    (0x42C)
#define MJENC_Q_SRAM_REG_Q_0_16                                 MJENC_Q_SRAM_REG_Q_0_16
#define MJENC_Q_SRAM_REG_Q_0_16_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_16_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_16_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_16_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_16_POS)
#define MJENC_Q_SRAM_REG_Q_0_16_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_16_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_16_POS))
#define MJENC_Q_SRAM_REG_Q_0_17                                 MJENC_Q_SRAM_REG_Q_0_17
#define MJENC_Q_SRAM_REG_Q_0_17_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_17_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_17_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_17_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_17_POS)
#define MJENC_Q_SRAM_REG_Q_0_17_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_17_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_17_POS))

