sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x430 : mjpeg_q_param_18 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_18_OFFSET                    (0x430)
#define MJENC_Q_SRAM_REG_Q_0_18                                 MJENC_Q_SRAM_REG_Q_0_18
#define MJENC_Q_SRAM_REG_Q_0_18_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_18_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_18_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_18_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_18_POS)
#define MJENC_Q_SRAM_REG_Q_0_18_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_18_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_18_POS))
#define MJENC_Q_SRAM_REG_Q_0_19                                 MJENC_Q_SRAM_REG_Q_0_19
#define MJENC_Q_SRAM_REG_Q_0_19_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_19_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_19_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_19_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_19_POS)
#define MJENC_Q_SRAM_REG_Q_0_19_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_19_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_19_POS))

/* 0x434 : mjpeg_q_param_1a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_1A_OFFSET                    (0x434)
#define MJENC_Q_SRAM_REG_Q_0_1A                                 MJENC_Q_SRAM_REG_Q_0_1A
#define MJENC_Q_SRAM_REG_Q_0_1A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_1A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1A_POS)
#define MJENC_Q_SRAM_REG_Q_0_1A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1A_POS))
#define MJENC_Q_SRAM_REG_Q_0_1B                                 MJENC_Q_SRAM_REG_Q_0_1B
#define MJENC_Q_SRAM_REG_Q_0_1B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_1B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1B_POS)
#define MJENC_Q_SRAM_REG_Q_0_1B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1B_POS))

/* 0x438 : mjpeg_q_param_1c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_1C_OFFSET                    (0x438)
#define MJENC_Q_SRAM_REG_Q_0_1C                                 MJENC_Q_SRAM_REG_Q_0_1C
#define MJENC_Q_SRAM_REG_Q_0_1C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_1C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1C_POS)
#define MJENC_Q_SRAM_REG_Q_0_1C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1C_POS))
#define MJENC_Q_SRAM_REG_Q_0_1D                                 MJENC_Q_SRAM_REG_Q_0_1D
#define MJENC_Q_SRAM_REG_Q_0_1D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_1D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1D_POS)
#define MJENC_Q_SRAM_REG_Q_0_1D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1D_POS))

/* 0x43C : mjpeg_q_param_1e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_1E_OFFSET                    (0x43C)
#define MJENC_Q_SRAM_REG_Q_0_1E                                 MJENC_Q_SRAM_REG_Q_0_1E
#define MJENC_Q_SRAM_REG_Q_0_1E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_1E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1E_POS)
#define MJENC_Q_SRAM_REG_Q_0_1E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1E_POS))
#define MJENC_Q_SRAM_REG_Q_0_1F                                 MJENC_Q_SRAM_REG_Q_0_1F
#define MJENC_Q_SRAM_REG_Q_0_1F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_1F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_1F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_1F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1F_POS)
#define MJENC_Q_SRAM_REG_Q_0_1F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_1F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_1F_POS))

/* 0x440 : mjpeg_q_param_20 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_20_OFFSET                    (0x440)
#define MJENC_Q_SRAM_REG_Q_0_20                                 MJENC_Q_SRAM_REG_Q_0_20
#define MJENC_Q_SRAM_REG_Q_0_20_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_20_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_20_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_20_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_20_POS)
#define MJENC_Q_SRAM_REG_Q_0_20_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_20_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_20_POS))
#define MJENC_Q_SRAM_REG_Q_0_21                                 MJENC_Q_SRAM_REG_Q_0_21
#define MJENC_Q_SRAM_REG_Q_0_21_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_21_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_21_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_21_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_21_POS)
#define MJENC_Q_SRAM_REG_Q_0_21_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_21_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_21_POS))

/* 0x444 : mjpeg_q_param_22 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_22_OFFSET                    (0x444)
#define MJENC_Q_SRAM_REG_Q_0_22                                 MJENC_Q_SRAM_REG_Q_0_22
#define MJENC_Q_SRAM_REG_Q_0_22_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_22_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_22_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_22_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_22_POS)
#define MJENC_Q_SRAM_REG_Q_0_22_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_22_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_22_POS))
#define MJENC_Q_SRAM_REG_Q_0_23                                 MJENC_Q_SRAM_REG_Q_0_23
#define MJENC_Q_SRAM_REG_Q_0_23_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_23_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_23_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_23_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_23_POS)
#define MJENC_Q_SRAM_REG_Q_0_23_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_23_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_23_POS))

/* 0x448 : mjpeg_q_param_24 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_24_OFFSET                    (0x448)
#define MJENC_Q_SRAM_REG_Q_0_24                                 MJENC_Q_SRAM_REG_Q_0_24
#define MJENC_Q_SRAM_REG_Q_0_24_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_24_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_24_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_24_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_24_POS)
#define MJENC_Q_SRAM_REG_Q_0_24_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_24_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_24_POS))
#define MJENC_Q_SRAM_REG_Q_0_25                                 MJENC_Q_SRAM_REG_Q_0_25
#define MJENC_Q_SRAM_REG_Q_0_25_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_25_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_25_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_25_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_25_POS)
#define MJENC_Q_SRAM_REG_Q_0_25_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_25_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_25_POS))

/* 0x44C : mjpeg_q_param_26 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_26_OFFSET                    (0x44C)
#define MJENC_Q_SRAM_REG_Q_0_26                                 MJENC_Q_SRAM_REG_Q_0_26
#define MJENC_Q_SRAM_REG_Q_0_26_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_26_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_26_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_26_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_26_POS)
#define MJENC_Q_SRAM_REG_Q_0_26_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_26_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_26_POS))
#define MJENC_Q_SRAM_REG_Q_0_27                                 MJENC_Q_SRAM_REG_Q_0_27
#define MJENC_Q_SRAM_REG_Q_0_27_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_27_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_27_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_27_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_27_POS)
#define MJENC_Q_SRAM_REG_Q_0_27_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_27_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_27_POS))

