sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x450 : mjpeg_q_param_28 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_28_OFFSET                    (0x450)
#define MJENC_Q_SRAM_REG_Q_0_28                                 MJENC_Q_SRAM_REG_Q_0_28
#define MJENC_Q_SRAM_REG_Q_0_28_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_28_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_28_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_28_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_28_POS)
#define MJENC_Q_SRAM_REG_Q_0_28_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_28_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_28_POS))
#define MJENC_Q_SRAM_REG_Q_0_29                                 MJENC_Q_SRAM_REG_Q_0_29
#define MJENC_Q_SRAM_REG_Q_0_29_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_29_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_29_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_29_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_29_POS)
#define MJENC_Q_SRAM_REG_Q_0_29_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_29_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_29_POS))

/* 0x454 : mjpeg_q_param_2a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_2A_OFFSET                    (0x454)
#define MJENC_Q_SRAM_REG_Q_0_2A                                 MJENC_Q_SRAM_REG_Q_0_2A
#define MJENC_Q_SRAM_REG_Q_0_2A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_2A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2A_POS)
#define MJENC_Q_SRAM_REG_Q_0_2A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2A_POS))
#define MJENC_Q_SRAM_REG_Q_0_2B                                 MJENC_Q_SRAM_REG_Q_0_2B
#define MJENC_Q_SRAM_REG_Q_0_2B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_2B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2B_POS)
#define MJENC_Q_SRAM_REG_Q_0_2B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2B_POS))

/* 0x458 : mjpeg_q_param_2c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_2C_OFFSET                    (0x458)
#define MJENC_Q_SRAM_REG_Q_0_2C                                 MJENC_Q_SRAM_REG_Q_0_2C
#define MJENC_Q_SRAM_REG_Q_0_2C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_2C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2C_POS)
#define MJENC_Q_SRAM_REG_Q_0_2C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2C_POS))
#define MJENC_Q_SRAM_REG_Q_0_2D                                 MJENC_Q_SRAM_REG_Q_0_2D
#define MJENC_Q_SRAM_REG_Q_0_2D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_2D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2D_POS)
#define MJENC_Q_SRAM_REG_Q_0_2D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2D_POS))

/* 0x45C : mjpeg_q_param_2e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_2E_OFFSET                    (0x45C)
#define MJENC_Q_SRAM_REG_Q_0_2E                                 MJENC_Q_SRAM_REG_Q_0_2E
#define MJENC_Q_SRAM_REG_Q_0_2E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_2E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2E_POS)
#define MJENC_Q_SRAM_REG_Q_0_2E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2E_POS))
#define MJENC_Q_SRAM_REG_Q_0_2F                                 MJENC_Q_SRAM_REG_Q_0_2F
#define MJENC_Q_SRAM_REG_Q_0_2F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_2F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_2F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_2F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2F_POS)
#define MJENC_Q_SRAM_REG_Q_0_2F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_2F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_2F_POS))

/* 0x460 : mjpeg_q_param_30 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_30_OFFSET                    (0x460)
#define MJENC_Q_SRAM_REG_Q_0_30                                 MJENC_Q_SRAM_REG_Q_0_30
#define MJENC_Q_SRAM_REG_Q_0_30_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_30_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_30_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_30_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_30_POS)
#define MJENC_Q_SRAM_REG_Q_0_30_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_30_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_30_POS))
#define MJENC_Q_SRAM_REG_Q_0_31                                 MJENC_Q_SRAM_REG_Q_0_31
#define MJENC_Q_SRAM_REG_Q_0_31_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_31_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_31_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_31_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_31_POS)
#define MJENC_Q_SRAM_REG_Q_0_31_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_31_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_31_POS))

/* 0x464 : mjpeg_q_param_32 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_32_OFFSET                    (0x464)
#define MJENC_Q_SRAM_REG_Q_0_32                                 MJENC_Q_SRAM_REG_Q_0_32
#define MJENC_Q_SRAM_REG_Q_0_32_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_32_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_32_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_32_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_32_POS)
#define MJENC_Q_SRAM_REG_Q_0_32_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_32_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_32_POS))
#define MJENC_Q_SRAM_REG_Q_0_33                                 MJENC_Q_SRAM_REG_Q_0_33
#define MJENC_Q_SRAM_REG_Q_0_33_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_33_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_33_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_33_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_33_POS)
#define MJENC_Q_SRAM_REG_Q_0_33_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_33_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_33_POS))

/* 0x468 : mjpeg_q_param_34 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_34_OFFSET                    (0x468)
#define MJENC_Q_SRAM_REG_Q_0_34                                 MJENC_Q_SRAM_REG_Q_0_34
#define MJENC_Q_SRAM_REG_Q_0_34_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_34_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_34_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_34_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_34_POS)
#define MJENC_Q_SRAM_REG_Q_0_34_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_34_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_34_POS))
#define MJENC_Q_SRAM_REG_Q_0_35                                 MJENC_Q_SRAM_REG_Q_0_35
#define MJENC_Q_SRAM_REG_Q_0_35_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_35_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_35_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_35_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_35_POS)
#define MJENC_Q_SRAM_REG_Q_0_35_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_35_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_35_POS))

/* 0x46C : mjpeg_q_param_36 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_36_OFFSET                    (0x46C)
#define MJENC_Q_SRAM_REG_Q_0_36                                 MJENC_Q_SRAM_REG_Q_0_36
#define MJENC_Q_SRAM_REG_Q_0_36_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_36_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_36_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_36_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_36_POS)
#define MJENC_Q_SRAM_REG_Q_0_36_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_36_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_36_POS))
#define MJENC_Q_SRAM_REG_Q_0_37                                 MJENC_Q_SRAM_REG_Q_0_37
#define MJENC_Q_SRAM_REG_Q_0_37_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_37_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_37_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_37_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_37_POS)
#define MJENC_Q_SRAM_REG_Q_0_37_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_37_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_37_POS))

/* 0x470 : mjpeg_q_param_38 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_38_OFFSET                    (0x470)
#define MJENC_Q_SRAM_REG_Q_0_38                                 MJENC_Q_SRAM_REG_Q_0_38
#define MJENC_Q_SRAM_REG_Q_0_38_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_38_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_38_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_38_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_38_POS)
#define MJENC_Q_SRAM_REG_Q_0_38_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_38_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_38_POS))
#define MJENC_Q_SRAM_REG_Q_0_39                                 MJENC_Q_SRAM_REG_Q_0_39
#define MJENC_Q_SRAM_REG_Q_0_39_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_39_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_39_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_39_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_39_POS)
#define MJENC_Q_SRAM_REG_Q_0_39_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_39_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_39_POS))

