sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x474 : mjpeg_q_param_3a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_3A_OFFSET                    (0x474)
#define MJENC_Q_SRAM_REG_Q_0_3A                                 MJENC_Q_SRAM_REG_Q_0_3A
#define MJENC_Q_SRAM_REG_Q_0_3A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_3A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3A_POS)
#define MJENC_Q_SRAM_REG_Q_0_3A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3A_POS))
#define MJENC_Q_SRAM_REG_Q_0_3B                                 MJENC_Q_SRAM_REG_Q_0_3B
#define MJENC_Q_SRAM_REG_Q_0_3B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_3B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3B_POS)
#define MJENC_Q_SRAM_REG_Q_0_3B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3B_POS))

/* 0x478 : mjpeg_q_param_3c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_3C_OFFSET                    (0x478)
#define MJENC_Q_SRAM_REG_Q_0_3C                                 MJENC_Q_SRAM_REG_Q_0_3C
#define MJENC_Q_SRAM_REG_Q_0_3C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_3C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3C_POS)
#define MJENC_Q_SRAM_REG_Q_0_3C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3C_POS))
#define MJENC_Q_SRAM_REG_Q_0_3D                                 MJENC_Q_SRAM_REG_Q_0_3D
#define MJENC_Q_SRAM_REG_Q_0_3D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_3D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3D_POS)
#define MJENC_Q_SRAM_REG_Q_0_3D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3D_POS))

/* 0x47C : mjpeg_q_param_3e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_3E_OFFSET                    (0x47C)
#define MJENC_Q_SRAM_REG_Q_0_3E                                 MJENC_Q_SRAM_REG_Q_0_3E
#define MJENC_Q_SRAM_REG_Q_0_3E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_0_3E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3E_POS)
#define MJENC_Q_SRAM_REG_Q_0_3E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3E_POS))
#define MJENC_Q_SRAM_REG_Q_0_3F                                 MJENC_Q_SRAM_REG_Q_0_3F
#define MJENC_Q_SRAM_REG_Q_0_3F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_0_3F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_0_3F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_0_3F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3F_POS)
#define MJENC_Q_SRAM_REG_Q_0_3F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_0_3F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_0_3F_POS))

/* 0x480 : mjpeg_q_param_40 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_40_OFFSET                    (0x480)
#define MJENC_Q_SRAM_REG_Q_1_00                                 MJENC_Q_SRAM_REG_Q_1_00
#define MJENC_Q_SRAM_REG_Q_1_00_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_00_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_00_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_00_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_00_POS)
#define MJENC_Q_SRAM_REG_Q_1_00_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_00_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_00_POS))
#define MJENC_Q_SRAM_REG_Q_1_01                                 MJENC_Q_SRAM_REG_Q_1_01
#define MJENC_Q_SRAM_REG_Q_1_01_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_01_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_01_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_01_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_01_POS)
#define MJENC_Q_SRAM_REG_Q_1_01_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_01_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_01_POS))

/* 0x484 : mjpeg_q_param_42 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_42_OFFSET                    (0x484)
#define MJENC_Q_SRAM_REG_Q_1_02                                 MJENC_Q_SRAM_REG_Q_1_02
#define MJENC_Q_SRAM_REG_Q_1_02_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_02_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_02_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_02_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_02_POS)
#define MJENC_Q_SRAM_REG_Q_1_02_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_02_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_02_POS))
#define MJENC_Q_SRAM_REG_Q_1_03                                 MJENC_Q_SRAM_REG_Q_1_03
#define MJENC_Q_SRAM_REG_Q_1_03_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_03_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_03_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_03_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_03_POS)
#define MJENC_Q_SRAM_REG_Q_1_03_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_03_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_03_POS))

/* 0x488 : mjpeg_q_param_44 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_44_OFFSET                    (0x488)
#define MJENC_Q_SRAM_REG_Q_1_04                                 MJENC_Q_SRAM_REG_Q_1_04
#define MJENC_Q_SRAM_REG_Q_1_04_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_04_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_04_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_04_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_04_POS)
#define MJENC_Q_SRAM_REG_Q_1_04_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_04_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_04_POS))
#define MJENC_Q_SRAM_REG_Q_1_05                                 MJENC_Q_SRAM_REG_Q_1_05
#define MJENC_Q_SRAM_REG_Q_1_05_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_05_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_05_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_05_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_05_POS)
#define MJENC_Q_SRAM_REG_Q_1_05_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_05_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_05_POS))

