sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x48C : mjpeg_q_param_46 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_46_OFFSET                    (0x48C)
#define MJENC_Q_SRAM_REG_Q_1_06                                 MJENC_Q_SRAM_REG_Q_1_06
#define MJENC_Q_SRAM_REG_Q_1_06_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_06_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_06_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_06_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_06_POS)
#define MJENC_Q_SRAM_REG_Q_1_06_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_06_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_06_POS))
#define MJENC_Q_SRAM_REG_Q_1_07                                 MJENC_Q_SRAM_REG_Q_1_07
#define MJENC_Q_SRAM_REG_Q_1_07_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_07_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_07_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_07_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_07_POS)
#define MJENC_Q_SRAM_REG_Q_1_07_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_07_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_07_POS))

/* 0x490 : mjpeg_q_param_48 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_48_OFFSET                    (0x490)
#define MJENC_Q_SRAM_REG_Q_1_08                                 MJENC_Q_SRAM_REG_Q_1_08
#define MJENC_Q_SRAM_REG_Q_1_08_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_08_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_08_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_08_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_08_POS)
#define MJENC_Q_SRAM_REG_Q_1_08_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_08_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_08_POS))
#define MJENC_Q_SRAM_REG_Q_1_09                                 MJENC_Q_SRAM_REG_Q_1_09
#define MJENC_Q_SRAM_REG_Q_1_09_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_09_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_09_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_09_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_09_POS)
#define MJENC_Q_SRAM_REG_Q_1_09_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_09_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_09_POS))

/* 0x494 : mjpeg_q_param_4a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_4A_OFFSET                    (0x494)
#define MJENC_Q_SRAM_REG_Q_1_0A                                 MJENC_Q_SRAM_REG_Q_1_0A
#define MJENC_Q_SRAM_REG_Q_1_0A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_0A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0A_POS)
#define MJENC_Q_SRAM_REG_Q_1_0A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0A_POS))
#define MJENC_Q_SRAM_REG_Q_1_0B                                 MJENC_Q_SRAM_REG_Q_1_0B
#define MJENC_Q_SRAM_REG_Q_1_0B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_0B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0B_POS)
#define MJENC_Q_SRAM_REG_Q_1_0B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0B_POS))

/* 0x498 : mjpeg_q_param_4c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_4C_OFFSET                    (0x498)
#define MJENC_Q_SRAM_REG_Q_1_0C                                 MJENC_Q_SRAM_REG_Q_1_0C
#define MJENC_Q_SRAM_REG_Q_1_0C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_0C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0C_POS)
#define MJENC_Q_SRAM_REG_Q_1_0C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0C_POS))
#define MJENC_Q_SRAM_REG_Q_1_0D                                 MJENC_Q_SRAM_REG_Q_1_0D
#define MJENC_Q_SRAM_REG_Q_1_0D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_0D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0D_POS)
#define MJENC_Q_SRAM_REG_Q_1_0D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0D_POS))

/* 0x49C : mjpeg_q_param_4e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_4E_OFFSET                    (0x49C)
#define MJENC_Q_SRAM_REG_Q_1_0E                                 MJENC_Q_SRAM_REG_Q_1_0E
#define MJENC_Q_SRAM_REG_Q_1_0E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_0E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0E_POS)
#define MJENC_Q_SRAM_REG_Q_1_0E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0E_POS))
#define MJENC_Q_SRAM_REG_Q_1_0F                                 MJENC_Q_SRAM_REG_Q_1_0F
#define MJENC_Q_SRAM_REG_Q_1_0F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_0F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_0F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_0F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0F_POS)
#define MJENC_Q_SRAM_REG_Q_1_0F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_0F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_0F_POS))

/* 0x4A0 : mjpeg_q_param_50 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_50_OFFSET                    (0x4A0)
#define MJENC_Q_SRAM_REG_Q_1_10                                 MJENC_Q_SRAM_REG_Q_1_10
#define MJENC_Q_SRAM_REG_Q_1_10_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_10_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_10_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_10_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_10_POS)
#define MJENC_Q_SRAM_REG_Q_1_10_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_10_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_10_POS))
#define MJENC_Q_SRAM_REG_Q_1_11                                 MJENC_Q_SRAM_REG_Q_1_11
#define MJENC_Q_SRAM_REG_Q_1_11_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_11_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_11_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_11_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_11_POS)
#define MJENC_Q_SRAM_REG_Q_1_11_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_11_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_11_POS))

/* 0x4A4 : mjpeg_q_param_52 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_52_OFFSET                    (0x4A4)
#define MJENC_Q_SRAM_REG_Q_1_12                                 MJENC_Q_SRAM_REG_Q_1_12
#define MJENC_Q_SRAM_REG_Q_1_12_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_12_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_12_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_12_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_12_POS)
#define MJENC_Q_SRAM_REG_Q_1_12_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_12_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_12_POS))
#define MJENC_Q_SRAM_REG_Q_1_13                                 MJENC_Q_SRAM_REG_Q_1_13
#define MJENC_Q_SRAM_REG_Q_1_13_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_13_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_13_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_13_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_13_POS)
#define MJENC_Q_SRAM_REG_Q_1_13_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_13_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_13_POS))

/* 0x4A8 : mjpeg_q_param_54 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_54_OFFSET                    (0x4A8)
#define MJENC_Q_SRAM_REG_Q_1_14                                 MJENC_Q_SRAM_REG_Q_1_14
#define MJENC_Q_SRAM_REG_Q_1_14_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_14_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_14_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_14_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_14_POS)
#define MJENC_Q_SRAM_REG_Q_1_14_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_14_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_14_POS))
#define MJENC_Q_SRAM_REG_Q_1_15                                 MJENC_Q_SRAM_REG_Q_1_15
#define MJENC_Q_SRAM_REG_Q_1_15_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_15_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_15_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_15_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_15_POS)
#define MJENC_Q_SRAM_REG_Q_1_15_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_15_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_15_POS))

/* 0x4AC : mjpeg_q_param_56 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_56_OFFSET                    (0x4AC)
#define MJENC_Q_SRAM_REG_Q_1_16                                 MJENC_Q_SRAM_REG_Q_1_16
#define MJENC_Q_SRAM_REG_Q_1_16_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_16_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_16_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_16_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_16_POS)
#define MJENC_Q_SRAM_REG_Q_1_16_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_16_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_16_POS))
#define MJENC_Q_SRAM_REG_Q_1_17                                 MJENC_Q_SRAM_REG_Q_1_17
#define MJENC_Q_SRAM_REG_Q_1_17_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_17_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_17_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_17_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_17_POS)
#define MJENC_Q_SRAM_REG_Q_1_17_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_17_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_17_POS))

/* 0x4B0 : mjpeg_q_param_58 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_58_OFFSET                    (0x4B0)
#define MJENC_Q_SRAM_REG_Q_1_18                                 MJENC_Q_SRAM_REG_Q_1_18
#define MJENC_Q_SRAM_REG_Q_1_18_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_18_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_18_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_18_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_18_POS)
#define MJENC_Q_SRAM_REG_Q_1_18_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_18_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_18_POS))
#define MJENC_Q_SRAM_REG_Q_1_19                                 MJENC_Q_SRAM_REG_Q_1_19
#define MJENC_Q_SRAM_REG_Q_1_19_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_19_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_19_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_19_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_19_POS)
#define MJENC_Q_SRAM_REG_Q_1_19_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_19_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_19_POS))

/* 0x4B4 : mjpeg_q_param_5a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_5A_OFFSET                    (0x4B4)
#define MJENC_Q_SRAM_REG_Q_1_1A                                 MJENC_Q_SRAM_REG_Q_1_1A
#define MJENC_Q_SRAM_REG_Q_1_1A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_1A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1A_POS)
#define MJENC_Q_SRAM_REG_Q_1_1A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1A_POS))
#define MJENC_Q_SRAM_REG_Q_1_1B                                 MJENC_Q_SRAM_REG_Q_1_1B
#define MJENC_Q_SRAM_REG_Q_1_1B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_1B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1B_POS)
#define MJENC_Q_SRAM_REG_Q_1_1B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1B_POS))

