sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x4B8 : mjpeg_q_param_5c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_5C_OFFSET                    (0x4B8)
#define MJENC_Q_SRAM_REG_Q_1_1C                                 MJENC_Q_SRAM_REG_Q_1_1C
#define MJENC_Q_SRAM_REG_Q_1_1C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_1C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1C_POS)
#define MJENC_Q_SRAM_REG_Q_1_1C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1C_POS))
#define MJENC_Q_SRAM_REG_Q_1_1D                                 MJENC_Q_SRAM_REG_Q_1_1D
#define MJENC_Q_SRAM_REG_Q_1_1D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_1D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1D_POS)
#define MJENC_Q_SRAM_REG_Q_1_1D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1D_POS))

/* 0x4BC : mjpeg_q_param_5e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_5E_OFFSET                    (0x4BC)
#define MJENC_Q_SRAM_REG_Q_1_1E                                 MJENC_Q_SRAM_REG_Q_1_1E
#define MJENC_Q_SRAM_REG_Q_1_1E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_1E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1E_POS)
#define MJENC_Q_SRAM_REG_Q_1_1E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1E_POS))
#define MJENC_Q_SRAM_REG_Q_1_1F                                 MJENC_Q_SRAM_REG_Q_1_1F
#define MJENC_Q_SRAM_REG_Q_1_1F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_1F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_1F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_1F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1F_POS)
#define MJENC_Q_SRAM_REG_Q_1_1F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_1F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_1F_POS))

/* 0x4C0 : mjpeg_q_param_60 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_60_OFFSET                    (0x4C0)
#define MJENC_Q_SRAM_REG_Q_1_20                                 MJENC_Q_SRAM_REG_Q_1_20
#define MJENC_Q_SRAM_REG_Q_1_20_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_20_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_20_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_20_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_20_POS)
#define MJENC_Q_SRAM_REG_Q_1_20_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_20_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_20_POS))
#define MJENC_Q_SRAM_REG_Q_1_21                                 MJENC_Q_SRAM_REG_Q_1_21
#define MJENC_Q_SRAM_REG_Q_1_21_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_21_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_21_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_21_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_21_POS)
#define MJENC_Q_SRAM_REG_Q_1_21_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_21_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_21_POS))

/* 0x4C4 : mjpeg_q_param_62 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_62_OFFSET                    (0x4C4)
#define MJENC_Q_SRAM_REG_Q_1_22                                 MJENC_Q_SRAM_REG_Q_1_22
#define MJENC_Q_SRAM_REG_Q_1_22_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_22_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_22_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_22_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_22_POS)
#define MJENC_Q_SRAM_REG_Q_1_22_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_22_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_22_POS))
#define MJENC_Q_SRAM_REG_Q_1_23                                 MJENC_Q_SRAM_REG_Q_1_23
#define MJENC_Q_SRAM_REG_Q_1_23_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_23_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_23_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_23_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_23_POS)
#define MJENC_Q_SRAM_REG_Q_1_23_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_23_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_23_POS))

/* 0x4C8 : mjpeg_q_param_64 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_64_OFFSET                    (0x4C8)
#define MJENC_Q_SRAM_REG_Q_1_24                                 MJENC_Q_SRAM_REG_Q_1_24
#define MJENC_Q_SRAM_REG_Q_1_24_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_24_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_24_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_24_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_24_POS)
#define MJENC_Q_SRAM_REG_Q_1_24_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_24_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_24_POS))
#define MJENC_Q_SRAM_REG_Q_1_25                                 MJENC_Q_SRAM_REG_Q_1_25
#define MJENC_Q_SRAM_REG_Q_1_25_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_25_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_25_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_25_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_25_POS)
#define MJENC_Q_SRAM_REG_Q_1_25_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_25_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_25_POS))

/* 0x4CC : mjpeg_q_param_66 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_66_OFFSET                    (0x4CC)
#define MJENC_Q_SRAM_REG_Q_1_26                                 MJENC_Q_SRAM_REG_Q_1_26
#define MJENC_Q_SRAM_REG_Q_1_26_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_26_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_26_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_26_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_26_POS)
#define MJENC_Q_SRAM_REG_Q_1_26_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_26_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_26_POS))
#define MJENC_Q_SRAM_REG_Q_1_27                                 MJENC_Q_SRAM_REG_Q_1_27
#define MJENC_Q_SRAM_REG_Q_1_27_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_27_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_27_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_27_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_27_POS)
#define MJENC_Q_SRAM_REG_Q_1_27_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_27_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_27_POS))

/* 0x4D0 : mjpeg_q_param_68 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_68_OFFSET                    (0x4D0)
#define MJENC_Q_SRAM_REG_Q_1_28                                 MJENC_Q_SRAM_REG_Q_1_28
#define MJENC_Q_SRAM_REG_Q_1_28_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_28_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_28_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_28_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_28_POS)
#define MJENC_Q_SRAM_REG_Q_1_28_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_28_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_28_POS))
#define MJENC_Q_SRAM_REG_Q_1_29                                 MJENC_Q_SRAM_REG_Q_1_29
#define MJENC_Q_SRAM_REG_Q_1_29_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_29_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_29_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_29_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_29_POS)
#define MJENC_Q_SRAM_REG_Q_1_29_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_29_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_29_POS))

/* 0x4D4 : mjpeg_q_param_6a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_6A_OFFSET                    (0x4D4)
#define MJENC_Q_SRAM_REG_Q_1_2A                                 MJENC_Q_SRAM_REG_Q_1_2A
#define MJENC_Q_SRAM_REG_Q_1_2A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_2A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2A_POS)
#define MJENC_Q_SRAM_REG_Q_1_2A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2A_POS))
#define MJENC_Q_SRAM_REG_Q_1_2B                                 MJENC_Q_SRAM_REG_Q_1_2B
#define MJENC_Q_SRAM_REG_Q_1_2B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_2B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2B_POS)
#define MJENC_Q_SRAM_REG_Q_1_2B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2B_POS))

