sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x4D8 : mjpeg_q_param_6c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_6C_OFFSET                    (0x4D8)
#define MJENC_Q_SRAM_REG_Q_1_2C                                 MJENC_Q_SRAM_REG_Q_1_2C
#define MJENC_Q_SRAM_REG_Q_1_2C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_2C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2C_POS)
#define MJENC_Q_SRAM_REG_Q_1_2C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2C_POS))
#define MJENC_Q_SRAM_REG_Q_1_2D                                 MJENC_Q_SRAM_REG_Q_1_2D
#define MJENC_Q_SRAM_REG_Q_1_2D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_2D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2D_POS)
#define MJENC_Q_SRAM_REG_Q_1_2D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2D_POS))

/* 0x4DC : mjpeg_q_param_6e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_6E_OFFSET                    (0x4DC)
#define MJENC_Q_SRAM_REG_Q_1_2E                                 MJENC_Q_SRAM_REG_Q_1_2E
#define MJENC_Q_SRAM_REG_Q_1_2E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_2E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2E_POS)
#define MJENC_Q_SRAM_REG_Q_1_2E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2E_POS))
#define MJENC_Q_SRAM_REG_Q_1_2F                                 MJENC_Q_SRAM_REG_Q_1_2F
#define MJENC_Q_SRAM_REG_Q_1_2F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_2F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_2F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_2F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2F_POS)
#define MJENC_Q_SRAM_REG_Q_1_2F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_2F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_2F_POS))

/* 0x4E0 : mjpeg_q_param_70 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_70_OFFSET                    (0x4E0)
#define MJENC_Q_SRAM_REG_Q_1_30                                 MJENC_Q_SRAM_REG_Q_1_30
#define MJENC_Q_SRAM_REG_Q_1_30_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_30_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_30_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_30_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_30_POS)
#define MJENC_Q_SRAM_REG_Q_1_30_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_30_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_30_POS))
#define MJENC_Q_SRAM_REG_Q_1_31                                 MJENC_Q_SRAM_REG_Q_1_31
#define MJENC_Q_SRAM_REG_Q_1_31_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_31_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_31_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_31_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_31_POS)
#define MJENC_Q_SRAM_REG_Q_1_31_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_31_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_31_POS))

/* 0x4E4 : mjpeg_q_param_72 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_72_OFFSET                    (0x4E4)
#define MJENC_Q_SRAM_REG_Q_1_32                                 MJENC_Q_SRAM_REG_Q_1_32
#define MJENC_Q_SRAM_REG_Q_1_32_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_32_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_32_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_32_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_32_POS)
#define MJENC_Q_SRAM_REG_Q_1_32_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_32_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_32_POS))
#define MJENC_Q_SRAM_REG_Q_1_33                                 MJENC_Q_SRAM_REG_Q_1_33
#define MJENC_Q_SRAM_REG_Q_1_33_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_33_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_33_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_33_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_33_POS)
#define MJENC_Q_SRAM_REG_Q_1_33_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_33_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_33_POS))

/* 0x4E8 : mjpeg_q_param_74 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_74_OFFSET                    (0x4E8)
#define MJENC_Q_SRAM_REG_Q_1_34                                 MJENC_Q_SRAM_REG_Q_1_34
#define MJENC_Q_SRAM_REG_Q_1_34_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_34_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_34_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_34_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_34_POS)
#define MJENC_Q_SRAM_REG_Q_1_34_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_34_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_34_POS))
#define MJENC_Q_SRAM_REG_Q_1_35                                 MJENC_Q_SRAM_REG_Q_1_35
#define MJENC_Q_SRAM_REG_Q_1_35_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_35_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_35_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_35_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_35_POS)
#define MJENC_Q_SRAM_REG_Q_1_35_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_35_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_35_POS))

/* 0x4EC : mjpeg_q_param_76 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_76_OFFSET                    (0x4EC)
#define MJENC_Q_SRAM_REG_Q_1_36                                 MJENC_Q_SRAM_REG_Q_1_36
#define MJENC_Q_SRAM_REG_Q_1_36_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_36_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_36_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_36_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_36_POS)
#define MJENC_Q_SRAM_REG_Q_1_36_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_36_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_36_POS))
#define MJENC_Q_SRAM_REG_Q_1_37                                 MJENC_Q_SRAM_REG_Q_1_37
#define MJENC_Q_SRAM_REG_Q_1_37_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_37_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_37_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_37_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_37_POS)
#define MJENC_Q_SRAM_REG_Q_1_37_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_37_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_37_POS))

/* 0x4F0 : mjpeg_q_param_78 */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_78_OFFSET                    (0x4F0)
#define MJENC_Q_SRAM_REG_Q_1_38                                 MJENC_Q_SRAM_REG_Q_1_38
#define MJENC_Q_SRAM_REG_Q_1_38_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_38_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_38_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_38_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_38_POS)
#define MJENC_Q_SRAM_REG_Q_1_38_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_38_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_38_POS))
#define MJENC_Q_SRAM_REG_Q_1_39                                 MJENC_Q_SRAM_REG_Q_1_39
#define MJENC_Q_SRAM_REG_Q_1_39_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_39_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_39_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_39_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_39_POS)
#define MJENC_Q_SRAM_REG_Q_1_39_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_39_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_39_POS))

/* 0x4F4 : mjpeg_q_param_7a */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_7A_OFFSET                    (0x4F4)
#define MJENC_Q_SRAM_REG_Q_1_3A                                 MJENC_Q_SRAM_REG_Q_1_3A
#define MJENC_Q_SRAM_REG_Q_1_3A_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_3A_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3A_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3A_POS)
#define MJENC_Q_SRAM_REG_Q_1_3A_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3A_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3A_POS))
#define MJENC_Q_SRAM_REG_Q_1_3B                                 MJENC_Q_SRAM_REG_Q_1_3B
#define MJENC_Q_SRAM_REG_Q_1_3B_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_3B_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3B_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3B_POS)
#define MJENC_Q_SRAM_REG_Q_1_3B_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3B_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3B_POS))

/* 0x4F8 : mjpeg_q_param_7c */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_7C_OFFSET                    (0x4F8)
#define MJENC_Q_SRAM_REG_Q_1_3C                                 MJENC_Q_SRAM_REG_Q_1_3C
#define MJENC_Q_SRAM_REG_Q_1_3C_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_3C_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3C_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3C_POS)
#define MJENC_Q_SRAM_REG_Q_1_3C_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3C_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3C_POS))
#define MJENC_Q_SRAM_REG_Q_1_3D                                 MJENC_Q_SRAM_REG_Q_1_3D
#define MJENC_Q_SRAM_REG_Q_1_3D_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_3D_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3D_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3D_POS)
#define MJENC_Q_SRAM_REG_Q_1_3D_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3D_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3D_POS))

