sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
/* 0x4FC : mjpeg_q_param_7e */
#define MJENC_Q_SRAM_MJPEG_Q_PARAM_7E_OFFSET                    (0x4FC)
#define MJENC_Q_SRAM_REG_Q_1_3E                                 MJENC_Q_SRAM_REG_Q_1_3E
#define MJENC_Q_SRAM_REG_Q_1_3E_POS                             (0U)
#define MJENC_Q_SRAM_REG_Q_1_3E_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3E_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3E_POS)
#define MJENC_Q_SRAM_REG_Q_1_3E_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3E_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3E_POS))
#define MJENC_Q_SRAM_REG_Q_1_3F                                 MJENC_Q_SRAM_REG_Q_1_3F
#define MJENC_Q_SRAM_REG_Q_1_3F_POS                             (16U)
#define MJENC_Q_SRAM_REG_Q_1_3F_LEN                             (12U)
#define MJENC_Q_SRAM_REG_Q_1_3F_MSK                             (((1U<<MJENC_Q_SRAM_REG_Q_1_3F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3F_POS)
#define MJENC_Q_SRAM_REG_Q_1_3F_UMSK                            (~(((1U<<MJENC_Q_SRAM_REG_Q_1_3F_LEN)-1)<<MJENC_Q_SRAM_REG_Q_1_3F_POS))


struct  mjenc_q_sram_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[1024];

    /* 0x400 : mjpeg_q_param_00 */
    union {
        struct {
            uint32_t reg_q_0_00                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_01                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_00;

    /* 0x404 : mjpeg_q_param_02 */
    union {
        struct {
            uint32_t reg_q_0_02                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_03                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_02;

    /* 0x408 : mjpeg_q_param_04 */
    union {
        struct {
            uint32_t reg_q_0_04                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_05                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_04;

    /* 0x40C : mjpeg_q_param_06 */
    union {
        struct {
            uint32_t reg_q_0_06                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_07                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_06;

    /* 0x410 : mjpeg_q_param_08 */
    union {
        struct {
            uint32_t reg_q_0_08                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_09                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_08;

    /* 0x414 : mjpeg_q_param_0a */
    union {
        struct {
            uint32_t reg_q_0_0a                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0b                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_0a;

    /* 0x418 : mjpeg_q_param_0c */
    union {
        struct {
            uint32_t reg_q_0_0c                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0d                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_0c;

    /* 0x41C : mjpeg_q_param_0e */
    union {
        struct {
            uint32_t reg_q_0_0e                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0f                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_0e;

    /* 0x420 : mjpeg_q_param_10 */
    union {
        struct {
            uint32_t reg_q_0_10                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_11                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_10;

    /* 0x424 : mjpeg_q_param_12 */
    union {
        struct {
            uint32_t reg_q_0_12                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_13                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_12;

    /* 0x428 : mjpeg_q_param_14 */
    union {
        struct {
            uint32_t reg_q_0_14                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_15                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_14;

    /* 0x42C : mjpeg_q_param_16 */
    union {
        struct {
            uint32_t reg_q_0_16                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_17                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_16;

