sipeed/M1s_BL808_SDK/components/stage/bl_mm/mm_drv/mm_reg/mjenc_q_sram_reg.h
    /* 0x4E8 : mjpeg_q_param_74 */
    union {
        struct {
            uint32_t reg_q_1_34                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_35                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_74;

    /* 0x4EC : mjpeg_q_param_76 */
    union {
        struct {
            uint32_t reg_q_1_36                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_37                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_76;

    /* 0x4F0 : mjpeg_q_param_78 */
    union {
        struct {
            uint32_t reg_q_1_38                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_39                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_78;

    /* 0x4F4 : mjpeg_q_param_7a */
    union {
        struct {
            uint32_t reg_q_1_3a                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_3b                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_7a;

    /* 0x4F8 : mjpeg_q_param_7c */
    union {
        struct {
            uint32_t reg_q_1_3c                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_3d                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_7c;

    /* 0x4FC : mjpeg_q_param_7e */
    union {
        struct {
            uint32_t reg_q_1_3e                     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_3f                     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mjpeg_q_param_7e;

};

typedef volatile struct mjenc_q_sram_reg mjenc_q_sram_reg_t;


#endif  /* __MJENC_Q_SRAM_REG_H__ */
